Repository: ErikEJ/EFCorePowerTools
Catalog: src/GUI/EFCorePowerTools/Locales/CompareLocale.*.resx
Languages: cs, fr, it, ko

source: Add...
cs: Přidat...
fr: Ajouter...
it: Aggiungi...
ko: 추가...

source: Add Database Connection
cs: Přidat připojení k databázi
fr: Ajouter une connexion de base de données...
it: Aggiungi database
ko: 데이터베이스 연결 추가

source: Anything
fr: Quelque chose
it: Tutto

source: Cannot compare context to database while debugging
cs: Během ladění není možné porovnávat obsah databáze
fr: Impossible de comparer le contexte à la base de données lors du débogage
it: Impossibile comparare il contesto e il database durante il debug
ko: 디버깅 중에는 컨텍스트를 데이터베이스와 비교할 수 없습니다

# CannotSupportVersion
source: Cannot support version {0}, notice that previews have limited support. You can try to manually install Microsoft.EntityFrameworkCore.Design preview.
cs: Verze {0} není podporována. Uvědomte si, že preview verze mají omezenou podporu. Můžete se pokusit nainstalovat Microsoft.EntityFrameworkCore.Design preview ručně.
fr: Impossible de prendre en charge la version {0}, notez que les préversions ont une prise en charge limitée. Vous pouvez essayer d'installer manuellement la préversion de Microsoft.EntityFrameworkCore.Design.
it: Versione {0} non supportata, ricorda che le preview hanno un supporto limitato. Puoi installare manualmente il pacchetto Microsoft.EntityFrameworkCore.Design preview.
ko: 버전 {0}은(는) 지원되지 않습니다. 미리보기 지원에는 제한이 있으므로 주의하십시오. Microsoft.EntityFrameworkCore.Design 미리보기를 수동으로 설치해 볼 수 있습니다.

# ChooseDatabaseContexts
source: Choose database and contexts
cs: Zvolte databáze a kontexty
fr: Choisissez la base de données et les contextes
it: Seleziona il database e le classi di contesto
ko: 데이터베이스 및 컨텍스트 선택

source: Close
cs: Zavřít
fr: Fermer
it: Chiudi
ko: 닫기

source: Column
fr: Colonne
it: Colonna

source: Column name
fr: Nom de colonne
it: Nome colonna

source: Column type
fr: Type de colonne
it: Tipo colonna

# CompareCompletedIn
source: Compare completed in {0}
cs: Porovnání dokončeno za {0}
fr: Comparaison effectuée en {0}
it: Comparazione completata in {0}
ko: {0}에서 비교 완료되었습니다

source: Comparing database with context(s)...
cs: Porovnává se databáze a kontext(y)...
fr: Comparaison de la base de données et du(des) contexte(s)
it: Sto comparando il database con i contesti...
ko: 데이터베이스와 컨텍스트 비교 중...

source: Comparison result
cs: Výsledek porovnání
fr: Résultat de la comparaison
it: Risultato della comparazione
ko: 비교 결과

source: Constraint name
fr: Nom de la contrainte
it: Nome vincolo

# ContextDatabaseMatch
source: Context(s) and database structure match
cs: Kontext(y) a struktura databáze jsou shodné
fr: Le(s) contexte(s) et la structure de la base de données est(sont) équivalent
it: I contesti e la struttura del database sono uguali
ko: 컨텍스트와 데이터베이스 구조 일치

source: Delete behabior
fr: Comportement à la suppression
it: Azione in cancellazione

source: Different
it: Differente

source: Entity
fr: Entité
it: Entità

source: Foreign key
fr: Clé étrangère
it: Chiave esterna

# HeaderAttribute
source: Attribute
cs: Atributy
fr: Attribut
it: Attributo
ko: 속성

# HeaderExpected
source: Expected
cs: Očekáváno
fr: Attendu
it: Atteso
ko: 예상

# HeaderFound
source: Found
cs: Nalezeno
fr: Trouvé
it: Trovato
ko: 발견

# HeaderName
source: Name
cs: Jméno
fr: Nom
it: Nome
ko: 이름

# HeaderState
source: State
cs: Stav
fr: Etat
it: Stato
ko: 상태

# HeaderType
source: Type
cs: Typ
it: Tipo
ko: 유형

source: Index
it: Indice

source: Index constraint name
fr: Nom de la contrainte d'index
it: Nome vincolo sull'indice

# InstallingEfCoreSchemaCompare
source: Installing EfCore.SchemaCompare version 5.1.3, please retry the command
cs: Instaluje se EfCore.SchemaCompare, zkuste, prosím, opakovat příkaz
fr: Installation de Ef Core.Schema Compare version 5.1.3, veuillez réessayer la commande
it: Sto installando EfCore.SchemaCompare versione 5.1.3, riprova il comando
ko: EFCore.SchemaCompare 설치 중입니다. 명령을 다시 시도하세요

source: Loading data
cs: Načítají se data
fr: Chargement des données
it: Sto caricando i dati
ko: 데이터 로드 중

source: Match anything
it: Compara tutto

source: No contexts selected
cs: Nejsou zvoleny žádné kontexty
fr: Aucun contexte sélectionné
it: Nessun contesto selezionato
ko: 컨텍스트가 선택되지 않았습니다

source: Not checked
fr: Non sélectionné
it: Non selezionato

source: Not in context
fr: Absent du contexte
it: Non presente nel contesto

source: Not in database
fr: Absent de la base de données
it: Non presente nel database

source: Not mapped to database
fr: Pas de correspondance avec la base de données
it: Nonmappato nel database

source: Not set
fr: Non défini
it: Non impostato

source: Nullability
fr: Nullabilité
it: Nullabilità

source: Persistent computed column
fr: Colonne calculée persistante
it: Colonna calcolata persistente

source: Primary key
fr: Clé primaire
it: Chiave primaria

source: Property
fr: Propriété
it: Proprietà

source: Remove selected connection
cs: Odstranit zvolené spojení
fr: Supprimer la connexion sélectionnée
it: Rimuovi la connessione selezionata
ko: 선택한 연결 제거

source: Show differences only
cs: Zobrazit pouze rozdíly
fr: Afficher uniquement les différences
it: Mostra solo le differenze
ko: 차이점만 표시

source: Sql computed column
fr: Colonne calculée SQL
it: Colonna SQL calcolata

source: Sql default value
fr: Valeur par défaut SQL
it: Valore SQL di default

source: Table
it: Tabella

source: Table name
fr: Nom de table
it: Nome tabella

# UnableToAddConnection
source: Unable to add connection, maybe the provider is not supported
cs: Nelze přidat připojení, je možné, že poskytovatel není podporován
fr: Impossible d'ajouter la connexion, peut-être que le fournisseur n'est pas pris en charge
it: Impossibile aggiungere la connessione, forse ilprovider non è supportato
ko: 연결을 추가할 수 없습니다. 지원되지 않는 공급자일 수 있습니다

source: Unable to collect DbContext information
cs: Nepodařilo se získat informace z DbContextu
fr: Impossible de collecter les informations du DbContext
it: Impossibile raccogliere informazioni sul contesto
ko: DbContext 정보를 수집할 수 없습니다

source: Unable to collect SchemaCompare information
cs: Nepodařilo se získat informace z SchemaCompare
fr: Impossible de collecter les informations SchemaCompare
it: Impossibile raccogliere informazioni da SchemaCompare
ko: SchemaCompare 정보를 수집할 수 없습니다

source: Unable to remove connection
cs: Nepodařilo se odstranit připojení
fr: Impossible de supprimer la connexion
it: Impossibile rimuovere la connessione
ko: 연결을 제거할 수 없습니다

source: Unique
it: Unico

source: Value generated
fr: Valeur générée
it: Valore generato

# VersionSupported
source: Only EF Core 5 is supported.
cs: Je podporován pouze EF Core 6 a novější.
fr: Seul EF Core 5 est pris en charge.
it: Solo EF Core 5 è supportato
ko: EF Core 6 이상만 지원됩니다.

source: Database
fr: Base de données
